api_tests/login-page-load_get_success.yaml
# ********RoostGPT********

# Test generated by RoostGPT for test Loginapp-api-test using AI Type Azure Open AI and AI Model roostgpt-4-32k
# 
# Test generated for /login-page-load_get for http method type GET in artillery framework
# RoostTestHash=1d8a2f85a3
# 
# 

# ********RoostGPT********
config:
  target: "{{ $processEnvironment.API_HOST }}"
  environments:
    dev:
      target: "https://dev.example.com"  
  phases:
    - duration: 10  
      arrivalRate: 1
  payload:
    path: "login-page-load_get_success.csv"
    fields:
      - "col1"
      - "col2"
    skipHeader: true
    delimiter: "^|^"
  plugins:
    expect: {}       

scenarios:
  - name: "Login page API requests"
    flow:
      - log: "Starting test requests..."
      - get:
          url: "/login-page-load"
          headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
      - capture:
            json: "$.key1"
            as: "value1"  
      - expect:    
            - statusCode: 200
            - hasProperty: "key1"
      - think: 2.5
      - log: "Requesting login page load API..."
      - post:
          url: "/login-page-load"
          json:
            col1: "{{ col1 }}"
            col2: "{{ col2 }}"
      - headers:
            Authorization: "Bearer {{$processEnvironment.AUTH_TOKEN}}"
      - expect:    
            - statusCode: 200
            - hasProperty: "response_text"
            - equals:
                - "{{ response_text }}"
                - "Login page loaded successfully"
      - think: 2.5
      - log: "Ending test requests..."